## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 34 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_lb.azlb
  * azurerm_lb_backend_address_pool.azlb_backend
  * azurerm_lb_backend_address_pool_address.azlb_backend_address[&#34;lb_address_1&#34;]
  * azurerm_lb_backend_address_pool_address.azlb_backend_address[&#34;lb_address_2&#34;]
  * azurerm_lb_backend_address_pool_address.azlb_backend_address[&#34;lb_address_3&#34;]
  * azurerm_lb_probe.azlb[&#34;1099&#34;]
  * azurerm_lb_probe.azlb[&#34;24007&#34;]
  * azurerm_lb_probe.azlb[&#34;24008&#34;]
  * azurerm_lb_probe.azlb[&#34;40001&#34;]
  * azurerm_lb_probe.azlb[&#34;443&#34;]
  * azurerm_lb_probe.azlb[&#34;49152&#34;]
  * azurerm_lb_probe.azlb[&#34;49153&#34;]
  * azurerm_lb_probe.azlb[&#34;5432&#34;]
  * azurerm_lb_probe.azlb[&#34;80&#34;]
  * azurerm_lb_probe.azlb[&#34;8005&#34;]
  * azurerm_lb_probe.azlb[&#34;8080&#34;]
  * azurerm_lb_probe.azlb[&#34;8090&#34;]
  * azurerm_lb_probe.azlb[&#34;8091&#34;]
  * azurerm_lb_probe.azlb[&#34;8095&#34;]
  * azurerm_lb_rule.azlb[&#34;1099&#34;]
  * azurerm_lb_rule.azlb[&#34;24007&#34;]
  * azurerm_lb_rule.azlb[&#34;24008&#34;]
  * azurerm_lb_rule.azlb[&#34;40001&#34;]
  * azurerm_lb_rule.azlb[&#34;443&#34;]
  * azurerm_lb_rule.azlb[&#34;49152&#34;]
  * azurerm_lb_rule.azlb[&#34;49153&#34;]
  * azurerm_lb_rule.azlb[&#34;5432&#34;]
  * azurerm_lb_rule.azlb[&#34;80&#34;]
  * azurerm_lb_rule.azlb[&#34;8005&#34;]
  * azurerm_lb_rule.azlb[&#34;8080&#34;]
  * azurerm_lb_rule.azlb[&#34;8090&#34;]
  * azurerm_lb_rule.azlb[&#34;8091&#34;]
  * azurerm_lb_rule.azlb[&#34;8095&#34;]
  * azurerm_private_dns_zone_virtual_network_link.postgres_dns_zone_vnet_link
* Update
  * azurerm_application_gateway.ag
  * azurerm_postgresql_server.atlassian-server
  * azurerm_private_endpoint.postgres_private_endpoint




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-cnf" -> null
          - ip_addresses = [
              - "10.0.4.201",
            ] -> null
          - name         = "appgw-backend-pool-cnf" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.200",
              + "10.0.4.201",
            ]
          + name         = "appgw-backend-pool-cnf"
        }

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (17 unchanged blocks hidden)
    }

  # azurerm_lb.azlb will be created
  + resource "azurerm_lb" "azlb" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "atlassian-nonprod-lb-glusterfs"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "atlassian-nonprod-rg"
      + sku                  = "Basic"
      + sku_tier             = "Regional"
      + tags                 = {
          + "application"  = "atlassian"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "lb-glusterfs-front-ip"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.0.4.150"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet/subnets/atlassian-int-subnet-dat"
        }
    }

  # azurerm_lb_backend_address_pool.azlb_backend will be created
  + resource "azurerm_lb_backend_address_pool" "azlb_backend" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "atlassian-nonprod-lb-glusterfs-backend-pool"
      + outbound_rules            = (known after apply)
    }

  # azurerm_lb_backend_address_pool_address.azlb_backend_address["lb_address_1"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "azlb_backend_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.0.4.132"
      + name                          = "atlassian-nonprod-gluster-01"
      + virtual_network_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet"
    }

  # azurerm_lb_backend_address_pool_address.azlb_backend_address["lb_address_2"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "azlb_backend_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.0.4.133"
      + name                          = "atlassian-nonprod-gluster-02"
      + virtual_network_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet"
    }

  # azurerm_lb_backend_address_pool_address.azlb_backend_address["lb_address_3"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "azlb_backend_address" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.0.4.134"
      + name                          = "atlassian-nonprod-gluster-03"
      + virtual_network_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet"
    }

  # azurerm_lb_probe.azlb["1099"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "1099"
      + number_of_probes    = 2
      + port                = 1099
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["24007"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "24007"
      + number_of_probes    = 2
      + port                = 24007
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["24008"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "24008"
      + number_of_probes    = 2
      + port                = 24008
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["40001"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "40001"
      + number_of_probes    = 2
      + port                = 40001
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["443"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "443"
      + number_of_probes    = 2
      + port                = 443
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["49152"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "49152"
      + number_of_probes    = 2
      + port                = 49152
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["49153"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "49153"
      + number_of_probes    = 2
      + port                = 49153
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["5432"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "5432"
      + number_of_probes    = 2
      + port                = 5432
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["80"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "80"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["8005"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "8005"
      + number_of_probes    = 2
      + port                = 8005
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["8080"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "8080"
      + number_of_probes    = 2
      + port                = 8080
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["8090"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "8090"
      + number_of_probes    = 2
      + port                = 8090
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["8091"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "8091"
      + number_of_probes    = 2
      + port                = 8091
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_probe.azlb["8095"] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "8095"
      + number_of_probes    = 2
      + port                = 8095
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_rule.azlb["1099"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 1099
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 1099
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "1099_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["24007"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 24007
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 24007
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8080_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["24008"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 24008
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 24008
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "24008_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["40001"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 40001
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 40001
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "40001_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["443"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 443
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "443_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["49152"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 49152
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 49152
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "49152_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["49153"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 49153
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 49153
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "49153_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["5432"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 5432
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 5432
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "5432_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["80"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "80_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["8005"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8005
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 8005
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8005_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["8080"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8080
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 8080
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8080_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["8090"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8090
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 8090
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8090_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["8091"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8091
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 8091
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8091_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_lb_rule.azlb["8095"] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8095
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-glusterfs-front-ip"
      + frontend_port                  = 8095
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "8095_GLUSTER_TCP-RULE"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
      ~ tags                              = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # azurerm_private_dns_zone_virtual_network_link.postgres_dns_zone_vnet_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres_dns_zone_vnet_link" {
      + id                    = (known after apply)
      + name                  = "atlassian-nonprod-postgres-dns-vnet-link"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + virtual_network_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet"
    }

  # azurerm_private_endpoint.postgres_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "postgres_private_endpoint" {
        id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe"
        name                          = "atlassian-nonprod-postgres-pe"
      ~ tags                          = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 34 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->